app/controllers/account_controller.rb

SELECT * FROM "users" WHERE ("users"."login" = E'dima') LIMIT 1
---
  def login
    return unless request.post?
    self.current_user = User.authenticate(params[:login], params[:password])
    if logged_in?
      session[:login] = User.find(self.current_user).login

SELECT * FROM "users" WHERE ("users"."id" = 1)
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES(E'46c1827aaf1e84ed47cca1bbb02256e797180712', '2009-05-06 19:22:18.745090', E'f0d24e443d3459a88809ad797394e09b7e1a4426', NULL, NULL, E'dima', E'dima85@mail.ru', '2009-05-06 19:22:18.745090') RETURNING "id"
---
  def signup
    if User.find(:all, :limit => '1').empty? or self.current_user == User.find(1)
      @user = User.new(params[:user])
      return unless request.post?
      @user.save!