app/controllers/customers_controller.rb

SELECT * FROM "customers"
---
  def index
    @customers = Customer.all