app/controllers/hotel_controller.rb

  def save
    unless params[:city][:name].empty?
    @city = City.find_by_name(params[:city][:name])
    params['hotel']['city_id'] = @city.id
    params['hotel']['country_id'] = @city.country_id
    @hotel = Hotel.create(params['hotel'])
---
SELECT * FROM "cities" WHERE ("cities"."name" = E'moscow') LIMIT 1
INSERT INTO "hotels" ("name", "country_id", "description", "city_id") VALUES(E'wewewe', 5, E'', 2) RETURNING "id"