app/controllers/tourist_controller.rb

SELECT * FROM "tourists" ORDER BY tourists.created_at desc LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "tourists"
---
  def index
    #@tourists = Tourist.find(:all)
    params[:page] ||= 1
    @tourists = Tourist.paginate :page => params[:page], :order => 'id DESC'