app/controllers/tourist_controller.rb

SELECT * FROM "tourists" WHERE ("tourists"."id" = E'644537243') LIMIT 1
---
  def edit
    @tourist = Tourist.find_by_id(params[:id])