app/controllers/travel_controller.rb

SELECT * FROM "travels" WHERE ("travels"."id" = 3382505)
---
  def edit
    @travel = Travel.find(params[:id])

SELECT * FROM "tourists" WHERE ("tourists"."surname_kir" = E'surname_kir_49') LIMIT 1
SELECT * FROM "travels" WHERE ("travels"."id" = E'3382505') LIMIT 1
---
   def save
     # список туристов - без главного(платящего)
     if params['travel']['surname_kir'].empty?
       flash[:error] = "А где плательщик ?"
       redirect_to :action => 'index'
     else

     # FIXME необходимо подправить используя nested из 2.3.2
     @travelpoint_hash = Hash.new

       params['travel'].each do |key,val|
         if key =~ /^surname_kir\d+$/ and val != ""
           @alltourists ? @alltourists += ',' : @alltourists = ""
           @alltourists += Tourist.find(:first, :conditions => ['surname_kir = ? and name_kir = ?',val.split(' ')[0], val.split(' ')[1]]).id.to_s # тут вставляются имена туристов которые едут кроме плательщика
         end
         if key =~ /^travelpoint\d+$/ and val['country_id'] != "" and val['city_id'] != "" and val['hotel_id'] != ""
           @travelpoint_hash[key] = val
         end
       end

        @pay_tourist_id = Tourist.find_by_surname_kir(params['travel']['surname_kir'].split(' ')[0]).id
        params[:id] =~ /^\d+$/ ? @travel = Travel.find_by_id(params[:id]) : @travel = Travel.new

UPDATE "travels" SET "doplata" = NULL, "start" = '2009-04-30', "updated_at" = '2009-05-30 07:09:39.283518', "user_id" = 3 WHERE "id" = 3382505
SELECT * FROM "travelpoints" WHERE ("travelpoints".travel_id = 3382505)
---

        if params['travel']['doplata'] =~ /^$/ or @travel.summa.to_i == @travel.cena.to_i
          then
          @travel.save!
          @@id_tp = []
          @travel.travelpoint.each do |x|

INSERT INTO "travelpoints" ("travel_id", "updated_at", "country_id", "roomtype_id", "foodtype_id", "city_id", "hotel_id", "date_start", "date_end", "created_at") VALUES(3382505, '2009-05-29 12:20:22.228462', 5, 1045624657, 728569809, 2, 1, '2009-05-21', '2009-05-30', '2009-05-29 12:20:22.228462') RETURNING "id"
---
              Travelpoint.update(val['id'],val)
              @@id << val['id'].to_i
            else
              @@id << Travelpoint.create(val)

SELECT * FROM "tourists" WHERE ("tourists"."id" = 644604893)
SELECT * FROM "travels" WHERE ("travels"."id" = 3382505)
SELECT * FROM "travels" ORDER BY travels.created_at desc LIMIT 20 OFFSET 0
SELECT * FROM "users" WHERE ("users"."id" = 3) LIMIT 1
SELECT count(*) AS count_all FROM "travels"
---
   def find_by_tourist
     # {"commit"=>"Найти", "authenticity_token"=>"YrzTZ/ItHfJTRcXV9PldA8Z6VJe9b4XZDzliiFuzFj0=", "travel"=>{"surname_kir"=>"surname_kir_49 name_kir_49"}}

     @tourist = Tourist.find(:all, :conditions => ['surname_kir =? and name_kir = ?',  params['travel']['surname_kir'].split(' ')[0] , params['travel']['surname_kir'].split(' ')[1]])
     @travels_grid = initialize_grid(Travel,
                               :conditions => ['tourists_array like ?', @tourist.collect {|x| '%' + x.id.to_s + '%' }],
                               :order => 'created_at',
                               :order_direction => 'desc',
                               :per_page => 20,
                               :include => [:user, :tourist])

SELECT * FROM "travelpoints" WHERE ("travelpoints".travel_id = 3382505)
SELECT min("travelpoints".date_start) AS min_date_start FROM "travelpoints" WHERE ("travelpoints".travel_id = 3382505)
---
   def view
     @travel = Travel.find(params[:id])
     @month = month_ru(@travel.created_at.mon)
     @users = []
     @users << @travel.tourist
     if @travel.tourists_array
       @users << Tourist.find(@travel.tourists_array)
     end
     @start_date = @travel.travelpoint.minimum('date_start')

SELECT * FROM "customers" LIMIT 1
SELECT * FROM "travelpoints" WHERE ("travelpoints".travel_id = 3382505)
SELECT min("travelpoints".date_start) AS min_date_start FROM "travelpoints" WHERE ("travelpoints".travel_id = 3382505)
---
   def get_zayavka_rtf # генерить будем сразу и договор и заявку в odf
     @travel = Travel.find(params[:id])
     @c = Customer.first
     @users = []
     @users << @travel.tourist
     if @travel.tourists_array
       @users << Tourist.find(@travel.tourists_array)
     end
     @start_date = @travel.travelpoint.minimum('date_start')

SELECT * FROM "customers" LIMIT 1
---
   def get_dogovor_ods
     @travel = Travel.find(params[:id])
     @c = Customer.first