app/controllers/travelpoint_controller.rb

SELECT * FROM "cities" WHERE (country_id = E'5')
---
  def city_select
    if params[:item] =~ /^\d*$/ and params[:item]!= ""
      @nom = params[:id]
      @city = City.find(:all, :conditions => [ "country_id = ?", params[:item] ])

SELECT * FROM "hotels" WHERE (city_id = E'2')
---
  def hotel_select
    if params[:item] =~ /^\d*$/ and params[:item]!= ""
      @nom = params[:id]
      @hotel = Hotel.find(:all, :conditions => [ "city_id = ?", params[:item] ])