app/controllers/tyropers_controller.rb

  def index
    @tyropers = Tyroper.all
---
SELECT * FROM "tyropers"